#include <stdio.h>

// Массивы - расширение понятия переменной

// Переменная - это наименование места, где хранится какое-то значение.
// Участок памяти, которое имеет некое буквенное название и тип данных.

// Массив - это множество переменных под одним названием.

int main(){
    // int a;
    // a = 0;
    // printf("a = %d\n", a);

    int massiv[4];
    massiv[0] = 0;
    massiv[1] = 1;
    massiv[2] = 2;
    massiv[3] = 3;

    // printf("%d\n", massiv); // not worked
    printf("%d %d %d %d", massiv[0], massiv[1], massiv[2], massiv[3]);

}


