
// Парадигмы

// Ассемблеры - парадигма очень низко-уровневного языка программирования. Неструктурный.
// arx, rbx, brx
// m1: add arx, 5
// sub arx, 5
// mul
// div
// jmp m1

// if, for

// Структурности
// Си - пример структурного языка. Процедурные языки программирования.
// функции, условные выражения, циклы, время жизни переменных, области видимости

// Объектно-ориентированные языки программирования.
// классы
// методы

// class MyClass:
//     def doSmth(int x):
//         print(x)

// a = MyClass()
// a.doSmth(5)
// lst = list()
// lst.append(5)
